/* 
 * main.cpp
 * 
 * Lab 02
 * Task 03
 * Разработать класс «Вектор» – Vector размерности n.
 * Определить несколько конструкторов, в том числе конструктор 
 * копирования. Реализовать методы для вычисления модуля вектора, 
 * скалярного произведения, сложения, вычитания, умножения на 
 * константу. Перегрузить операции сложения, вычитания, умножения, 
 * инкремента, декремента, индексирования, присваивания для данного 
 * класса. Создать массив объектов. Написать функцию, которая для 
 * заданной пары векторов будет определять, являются ли они коллинеарными 
 * или ортогональными.
 * 
 * Developed by Paul z4p Radkevich
 */

#include <iostream>
#include "vector.h"

using namespace std;

int main(int argc, char** argv) {
    
    
    return 0;
}
